<!DOCTYPE html>
<html lang="de">
	<head>
		<title>Cookie Engineer's Lebenslauf (in Deutsch)</title>

		<!-- Website Design -->
		<link rel="stylesheet" href="/design/layout/index.css">
		<link rel="stylesheet" href="/design/about/index.css">
		<link rel="stylesheet" href="/design/about/avatar/index.css">

		<!-- Website Functionality -->
		<link rel="stylesheet" href="/design/menu/index.css">
		<script src="/design/menu/index.js" defer></script>

		<!-- CV Design -->
		<link rel="stylesheet" href="/cv/design/index.css">
		<script src="/cv/design/index.js" defer></script>

		<!-- CV Functionality -->
		<link rel="stylesheet" href="/cv/design/crypto/index.css">
		<script src="/cv/design/crypto/index.js" defer></script>

	</head>
	<body>

		<header>
			<aside id="menu" class="visible">
				<button id="menu-button"><i></i></button>
				<a href="#about">&Uuml;ber&nbsp;Mich</a>
				<a href="#skills">F&auml;higkeiten</a>
				<a href="#employers">Arbeitgeber</a>
				<a href="#education">Bildung</a>
				<a href="#volunteer">Au&szlig;erberufliche&nbsp;Aktivit&auml;ten</a>
				<a href="#open-source">Open&nbsp;Source</a>
				<a class="icon-section" href="/index.html">Portfolio</a>
				<a class="icon-section" href="/weblog/index.html">Web&nbsp;Log</a>
			</aside>
		</header>

		<section id="about">
			<figure id="avatar">
				<img alt="Cookie Engineer's Avatar" src="/design/about/avatar/cookiengineer.png" width="256" height="256">
				<figcaption>
					Hallo, Ich bin <b>Cookie Engineer</b>,<br>
					wahrscheinlich ein verr&uuml;ckter Engineer mit AI, NetSec, WebSec, OSINT Erfahrung.
				</figcaption>
			</figure>
		</section>

		<section id="crypto">
			<h1>CV Kennwort.</h1>
			<article>
				<p>
					Du hast ein spezielles Kennwort von mir erhalten?
					Dann gebe es hier ein um all die geheimen Details zu erfahren.
				</p>
				<p>
					Dieses Feature ben&ouml;tigt einen Web Browser mit Support f&uuml;r die <a target="_blank" href="https://caniuse.com/cryptography">Web Crypto API</a>.
				</p>
				<input type="password">
				<ul></ul>
				<p>
					Wenn du kein Kennwort erhalten hast aber dennoch weiter lesen willst, bist du gerne
					willkommen einen Blick auf den <a target="_blank" href="./design/crypto.js">Quellcode</a>
					zu werfen. Ich w&auml;re schon etwas beeindruckt, wenn Du es schaffst ein Kennwort
					zu bruteforcen :)
				</p>
			</article>
		</section>

		<section id="skills" class="momentum">
			<h1>F&auml;higkeiten.</h1>
			<article>
				<h3>Netzwerksicherheit</h3> <progress value="95" max="100" data-label="15 Jahre"></progress>
				<p>
					Ich habe ein stark vertieftes Wissen im Bereich der Netzwerkprotokolle, deren Implementierungen
					und deren Probleme mit den Spezifikationen, welche zu potenziellen Attackenvektoren f&uuml;hren
					k&ouml;nnen.
					<br><br>
					Mein Fachwissen beinhaltet Implementierungs-Level-Kenntnisse in TCP, UDP, MQTT, SNMP, SOCKS, TLS
					und alle Web-bezogenen Protokolle wie HTTP/S, SPDY, QUIC, DNS, DNS over HTTPS, DNS over TLS,
					DNS-basierte Service Discovery, WebRTC und WebSockets.
					<br><br>
					Da die meisten meiner Programme peer-to-peer sind, verwenden diese auch NAT Traversal- und NAT
					Hole Punching-Techniken. Diese Techniken sind &auml;hnlich zu dem Vorkommen in Military-Grade
					Malware, da die meisten dieser mittlerweile auf DNS Exfiltration und PWNAT basierte Attacken
					setzen, um ihr Command-and-Control Center zu kontaktieren nach einer erfolgreichen Infiltration
					der Ger&auml;te.
				</p>
			</article>
			<article>
				<h3>Netzwerkanalyse</h3> <progress value="75" max="100" data-label="10 Jahre"></progress>
				<p>
					Meine Erfahrung als Redteam und Blueteam NetSec Experte hilft mir, ein tiefgreifendes
					Verst&auml;ndnis dar&uuml;ber aufzubauen, wie man ein trainierbares automatisiertes
					Netzwerksicherheitssystem aufbaut, welches zudem von Traffic Fingerprinting und
					Verhaltensanalyse der vernetzten Ger&auml;te lernen kann.
					<br><br>
					Meine Arbeit mit Co-Evolution&auml;ren Systemen wie Backpropagated ES/HyperNEAT versetzt
					mich in die Lage, virtuelle Simulationen und Pentesting Szenarien aufzubauen, die einfach
					replizierbar und adaptierbar zu neuen potenziellen Infiltrationszielen sind.
					<br><br>
					Zudem sind diese virtuellen isolierten Umgebungen meist Multi-Agenten Simulationen von
					gro&szlig;en Netzwerktopologien und verwenden bereits existierende PCAP-Dateien oder
					-Streams aus vorherigen Angriffszenarien wieder um das CPPN effizienter trainieren
					zu k&ouml;nnen.
				</p>
			</article>
			<article>
				<h3>Netzwerkforensik</h3> <progress value="50" max="100" data-label="~7.5 Jahre"></progress>
				<p>
					Meine bisherigen Arbeitgeber beinhalten verschiedene Cyber Defense Unternehmen f&uuml;r
					das Milit&auml;r und andere gr&ouml;&szlig;ere Organisationen. In meiner Zeit dort habe
					ich viel &uuml;ber die <q>God's Eye</q> Perspektive von Internetdienstanbietern gelernt,
					und wie diese gro&szlig;fl&auml;chige Rasterfahndungen und Korrelationen von verschl&uuml;sselten
					Netzwerkverbindungen erm&ouml;glichen.
					<br><br>
					In der Vergangenheit habe ich ebenfalls die Entwicklung eines gro&szlig;fl&auml;chigen
					Co-Evolution&auml;ren Netzwerkforensiksystems geleitet, welches verschl&uuml;sselte
					Netzwerkverbindungen im Clearnet, TOR und in einigen F&auml;llen sogar dem Darknet
					(aka TOR und I2P) analysieren, klassifizieren und Korrelationen verifizieren konnte.
				</p>
			</article>
			<article>
				<h3>Webaufkl&auml;rung</h3> <progress value="100" max="100" data-label="20 Jahre"></progress>
				<p>
					Als Ich zum ersten Mal im Alter von 10 Jahren online ging, habe ich die meiste Zeit
					damit verbracht mir Wissen durch das neue Medium anzueignen. Ich sehe das Web als
					das direkt greifbare Wissen der Menschheit, man muss nur die richtige Frage stellen.
					<br><br>
					In den letzten Jahren waren einige meiner Projekte indirekt damit besch&auml;ftigt,
					OSINT Methodologien zu automatisieren, welche immer noch menschliche Interaktionen
					ben&ouml;tigen, wie beispielsweise <q>Research</q> und das <q>Stealth Browser</q>
					Projekt.
					<br><br>
					Meine besondere Perspektive mit der Verwendung von Co-Evolution&auml;ren KI Systemen
					erlaubt es mir, selbst-automatisierende und selbst-adaptierende Systeme zu bauen,
					welche die Grenzen des M&ouml;glichen &uuml;berschreiten, was man mit dem Wissen
					im Web machen kann.
				</p>
			</article>
		</section>

		<section id="employers" class="timeline">
			<h1>Arbeitgeber.</h1>
			<article>
				<p>Bitte gebe ein <a href="#crypto">Kennwort</a> an um diese (verschl&uuml;sselten) privaten Details zu sehen.</p>
			</article>
		</section>

		<section id="education" class="timeline">
			<h1>Bildung.</h1>
			<article>
				<p>Bitte gebe ein <a href="#crypto">Kennwort</a> an um diese (verschl&uuml;sselten) privaten Details zu sehen.</p>
			</article>
		</section>

		<section id="volunteer" class="timeline">
			<h1>Au&szlig;erberufliche&nbsp;Aktivit&auml;ten</h1>
			<article>
				<p>Bitte gebe ein <a href="#crypto">Kennwort</a> an um diese (verschl&uuml;sselten) privaten Details zu sehen.</p>
			</article>
		</section>

		<section id="open-source" class="timeline">
			<h1>Open Source.</h1>
			<article>
				<p>Bitte gebe ein <a href="#crypto">Kennwort</a> an um diese (verschl&uuml;sselten) privaten Details zu sehen.</p>
			</article>
		</section>

	</body>
</html>
